from graph import *
import math

windowSize(980, 600)
canvasSize(980, 600)

#небо, верхний кусок
penColor(255, 200, 170)
brushColor(255, 200, 170)
rectangle(0, 0, 980, 120)

#небо,серединка
penColor(255, 215, 198)
brushColor(255, 215, 198)
rectangle(0, 120, 980, 240)

#небо, нижний кусок
penColor(255, 200, 170)
brushColor(255, 200, 170)
rectangle(0, 240, 980, 360)

#земля
penColor(181, 126, 151)
brushColor(181, 126, 151)
rectangle(0, 360, 980, 600)

#солнце
penColor(255, 244, 62)
brushColor(255, 244, 62)
circle(490, 120, 50)

#облака
penColor(255, 185, 74)
brushColor(255, 185, 74)
polygon([(10, 245), (980, 170), (900, 150), (850, 165), (780, 130), (750, 125), (720, 100), (600, 180), (570, 150), (550, 170), (520, 160), (490, 208),
         (480, 190), (440, 200), (350, 140), (330, 120), (310, 90), (100, 230), (20, 225)])

#левое облако, покатый склон. парабола подогнана на глаз
# не ждите глубинных обЪяснений почему так а не иначе
x = -0.5
k = 0.02
a = []
while x <= 12:
    y = - 0.05 * x ** 2
    a.append((x * 20 + 30, y * 20 + 225))
    x += k
a.append((310, 90))
a.append((100, 230))
polygon(a)

#кусок правого облака, элллипс для скругленной вершины
#да я рисую по точкам и это очень заебисто
#но мне влом писать функцию которая собрет массив кортежей
#с кучей координат точек этого эллипса
for x in range(-15, 15):
    for y in range(-40, 0):
        if x ** 2 / (15 ** 2) + y ** 2 / (40 ** 2) <= 1:
            point(x + 710, y + 130)

#еще кусок правого облака, покатый склон к скругленной вершине.
#я знаю что там не свовсем синусоида но мне влом извращаться
x = 0
k = 0.02
a = []
while x <= 1.25 * math.pi:
    y = math.cos(x)
    a.append((x * 35 + 570, y * 35 + 115))
    x += k
a.append((670, 180))
a.append((600, 180))
polygon(a)

#еще кусок облака, покатый клон правее вершины.
#парабола опять на глаз
x = 0
k = 0.02
a = []
while x <= 4:
    y = 0.15 * x ** 2
    a.append((x * 20 + 780, y * 20 + 130))
    x += k
a.append((750, 150))
polygon(a)

#горы
penColor(166, 64, 19)
brushColor(166, 64, 19)
polygon([(0, 380), (980, 380), (980, 200), (940, 270), (900, 260), (860, 300), (810, 250), (740, 310), (560, 300),
        (490, 320), (450, 270), (380,250), (310, 320), (250, 270), (196, 360), (20, 255), (0, 255)])

#все еще горы, тот эллипсоидный кусок слева.
for x in range(-76, 76):
    for y in range(-150, 0):
        if x ** 2 / (76 ** 2) + y ** 2 / (150 ** 2) <= 1:
            point(x + 120, y + 360)

#все еще горы, покатая фигня справа.
#и опять мне влом извращаться на что-то круче синусоиды
x = 0.5 * math.pi
k = 0.02
a = []
while x <= 2.25* math.pi:
    y = math.cos(x)
    a.append((x * 40 + 500, y * 40 + 275))
    x += k
a.append((500, 340))
polygon(a)

run()
#P.S. удачи :)